naanlizard/GootAC/lib/HomeKit-ESP8266/src/arduino_homekit_server.cpp
					json_string(json, (char*) encoded_data);

					free(encoded_data);
				}

				break;
			}
			}
		}

		if (!value && ch->getter_ex) {
			// called getter to get value, need to free it
			homekit_value_destruct(&v);
		}
	}
}

void write(client_context_t *context, byte *data, int data_size) {
	if ((!context) || (!context->socket) || (!context->socket->connected())) {
		CLIENT_ERROR(context, "The socket is null! (or is closed)");
		return;
	}
	if (context->disconnect) {
		context->error_write = true;
		return;
	}
	if (context->error_write) {
		CLIENT_ERROR(context, "Abort write data since error_write.");
		return;
	}
	CLIENT_VERBOSE(context, "Sending data of size %d", data_size);
	int write_size = context->socket->write(data, data_size);
	if (write_size != data_size) {
		CLIENT_ERROR(context, "socket.write, data_size=%d, write_size=%d", data_size, write_size);
		context->error_write = true;
		//context->socket->keepAlive(1, 1, 1);	// fast disconnected internally in 1 second.
		context->socket->stop();
	}
}

int client_send_encrypted_(client_context_t *context,
		byte *payload, size_t size) {
	CLIENT_VERBOSE(context, "Send encrypted of size %d", size);
	// max(size) = HOMEKIT_JSONBUFFER_SIZE + chunk_info(8) = 512 + 8 = 520
	if (!context || !context->encrypted)
		return -1;

	/*
	 HAP doc:
	 Each HTTP message is split into frames no larger than 1024 bytes.
	 Each frame has the following format:
	 <2:AAD for little endian length of encrypted data (n) in bytes>
	 <n:encrypted data according to AEAD algorithm, up to 1024 bytes>
	 <16:authTag according to AEAD algorithm>
	 Note by Wang Bin. 2020-03-07
	 */

	byte nonce[12];
	memset(nonce, 0, sizeof(nonce));

#define ENCRYPTED_BUFFER_SIZE 1024
#define AAD_SIZE 2
	// Moved this allocation to arduino_homekit_setup() so it is allocated only once, this
	// works because we are single-threaded so do not need to allow for parallel execution.
	// byte *encrypted = (byte*)malloc(ENCRYPTED_BUFFER_SIZE + 16 + AAD_SIZE);
	byte *encrypted = encryptedBuffer;
	size_t payload_offset = 0;

	while (payload_offset < size) {
		system_soft_wdt_feed(); // precaution against WDT timeout as we have crypto in this loop
		esp_yield(); // Let any system task run (like WiFi)
		size_t chunk_size = size - payload_offset;
		if (chunk_size > 1024)
			chunk_size = 1024;

		byte aead[2] = { (byte)(chunk_size % 256), (byte)(chunk_size / 256) };

		memcpy(encrypted, aead, 2);

		byte i = 4;
		int x = context->count_reads++;
		while (x) {
			nonce[i++] = x % 256;
			x /= 256;
		}

		size_t available = ENCRYPTED_BUFFER_SIZE + 16;
		int r = crypto_chacha20poly1305_encrypt(context->read_key, nonce, aead, AAD_SIZE,
				payload + payload_offset, chunk_size, encrypted + AAD_SIZE, &available);
		if (r) {
			ERROR("Failed to chacha encrypt payload (code %d)", r);
			//free(encrypted);
			return -1;
		}

		payload_offset += chunk_size;

		write(context, encrypted, available + AAD_SIZE);
	}

	//free(encrypted);
	return 0;
}

int client_decrypt_(client_context_t *context,
		byte *payload, size_t payload_size, byte *decrypted, size_t *decrypted_size) {
	if (!context || !context->encrypted)
		return -1;

	const size_t block_size = 1024 + 16 + 2;
	size_t required_decrypted_size = payload_size / block_size * 1024;
	if (payload_size % block_size > 0)
		required_decrypted_size += payload_size % block_size - 16 - 2;

	if (*decrypted_size < required_decrypted_size) {
		*decrypted_size = required_decrypted_size;
		return -2;
	}

	*decrypted_size = required_decrypted_size;

	byte nonce[12];
	memset(nonce, 0, sizeof(nonce));

	size_t payload_offset = 0;
	size_t decrypted_offset = 0;

	while (payload_offset < payload_size) {
		system_soft_wdt_feed(); // precaution against WDT timeout as we have crypto in this loop
		esp_yield(); // Let any system task run (like WiFi)
		size_t chunk_size = payload[payload_offset] + payload[payload_offset + 1] * 256;
		if (chunk_size + 18 > payload_size - payload_offset) {
			// Unfinished chunk
			break;
		}

		byte i = 4;
		int x = context->count_writes++;
		while (x) {
			nonce[i++] = x % 256;
			x /= 256;
		}

		size_t decrypted_len = *decrypted_size - decrypted_offset;
		int r = crypto_chacha20poly1305_decrypt(context->write_key, nonce, payload + payload_offset,
				2, payload + payload_offset + 2, chunk_size + 16, decrypted, &decrypted_len);
		if (r) {
			ERROR("Failed to chacha decrypt payload (code %d)", r);
			return -1;
		}

		decrypted_offset += decrypted_len;
		payload_offset += chunk_size + 18;
	}

	return payload_offset;
}

void client_notify_characteristic(homekit_characteristic_t *ch, homekit_value_t value,
		void *context) {
	client_context_t *client = (client_context_t*) context;

	if (client->current_characteristic == ch && client->current_value
			&& homekit_value_equal(client->current_value, &value)) {
		// This value is set by this client, no need to send notification
		CLIENT_DEBUG(client, "This value is set by this client, no need to send notification");
		return;
	}
	char * valstr;
	homekit_value_print(&valstr, &value);
	CLIENT_DEBUG(client, "Got characteristic %d.%d %s %s change event %s",
			ch->service->accessory->id, ch->id, ch->service->description, ch->description, valstr);
	free(valstr);

	//DEBUG("Got characteristic %d.%d change event", ch->service->accessory->id, ch->id);

	if (!client->event_queue) {
		ERROR("Client has no event queue. Skipping notification");
		return;
	}

	characteristic_event_t *event = (characteristic_event_t*) malloc(
			sizeof(characteristic_event_t));
	event->characteristic = ch;
	homekit_value_copy(&event->value, &value);

	VERBOSE("Sending event to client %d", client->socket);

	//xQueueSendToBack(client->event_queue, &event, 10);*/
	//q_push第二个参数要传指针地址
	q_push(client->event_queue, &event);
}

void client_send(client_context_t *context, byte *data, size_t data_size) {

	CLIENT_VERBOSE(context, "send data size=%d, encrypted=%s",
			data_size, context->encrypted ? "true" : "false");

	if (context->encrypted) {
		int r = client_send_encrypted_(context, data, data_size);
		if (r) {
			CLIENT_ERROR(context, "Failed to encrypt response (code %d)", r);
			return;
		}
	} else {
		write(context, data, data_size);
	}
}

