naanlizard/GootAC/lib/HomeKit-ESP8266/src/arduino_homekit_server.cpp
void client_send_P(client_context_t *context, PGM_P pgm) {
	XPGM_BUFFCPY_STRING(char, buff, pgm);
	client_send(context, (byte*)buff, sizeof(buff) - 1);
}

void client_send_chunk(byte *data, size_t size, void *arg) {
	client_context_t *context = (client_context_t*) arg;

	size_t payload_size = size + 8;
	byte *payload = (byte*) malloc(payload_size);
	if (!payload) {
		ERROR("Error malloc payload!! payload_size->%d", payload_size);
		return;
	}

	int offset = snprintf((char*) payload, payload_size, "%x\r\n", size);
	memcpy(payload + offset, data, size);
	payload[offset + size] = '\r';
	payload[offset + size + 1] = '\n';
	CLIENT_VERBOSE(context, "client_send_chunk, size=%d, offset=%d", size, offset);
	client_send(context, payload, offset + size + 2);
	free(payload);
}

void send_204_response(client_context_t *context) {
	static const char PROGMEM response[] = "HTTP/1.1 204 No Content\r\n\r\n";
	client_send_P(context, response);
}

void send_404_response(client_context_t *context) {
	static const char PROGMEM response[] = "HTTP/1.1 404 Not Found\r\n\r\n";
	client_send_P(context, response);
}

void send_client_events(client_context_t *context, client_event_t *events) {
	CLIENT_VERBOSE(context, "Sending EVENT");VERBOSE_HEAP();

	static const char PROGMEM http_headers[] = "EVENT/1.0 200 OK\r\n"
			"Content-Type: application/hap+json\r\n"
			"Transfer-Encoding: chunked\r\n\r\n";
	client_send_P(context, http_headers);

	// ~35 bytes per event JSON
	// 256 should be enough for ~7 characteristic updates
	json_stream *json = json_new(HOMEKIT_JSONBUFFER_SIZE, client_send_chunk, context);
	json_object_start(json);
	json_string(json, "characteristics");
	json_array_start(json);

	client_event_t *e = events;
	while (e) {
		json_object_start(json);
		write_characteristic_json(json, context, e->characteristic, (characteristic_format_t) 0,
				&e->value);
		json_object_end(json);

		e = e->next;
	}

	json_array_end(json);
	json_object_end(json);

	json_flush(json);
	json_free(json);

	client_send_chunk(NULL, 0, context);
}

void send_tlv_response(client_context_t *context, tlv_values_t *values);

void send_tlv_error_response(client_context_t *context, int state, TLVError error) {
	tlv_values_t *response = tlv_new();
	tlv_add_integer_value(response, TLVType_State, 1, state);
	tlv_add_integer_value(response, TLVType_Error, 1, error);

	send_tlv_response(context, response);
}

void send_tlv_response(client_context_t *context, tlv_values_t *values) {
	CLIENT_DEBUG(context, "Sending TLV response");TLV_DEBUG(values);
	system_soft_wdt_feed(); // precaution against WDT timeout
	esp_yield(); // Let any system task run (like WiFi)

	size_t payload_size = 0;
	tlv_format(values, NULL, &payload_size);

	byte *payload = (byte*) malloc(payload_size);
	int r = tlv_format(values, payload, &payload_size);
	if (r) {
		CLIENT_ERROR(context, "Failed to format TLV payload (code %d)", r);
		free(payload);
		return;
	}

	tlv_free(values);

	static const char PROGMEM http_headers_pgm[] = "HTTP/1.1 200 OK\r\n"
				"Content-Type: application/pairing+tlv8\r\n"
				"Content-Length: %d\r\n"
				"Connection: keep-alive\r\n\r\n";

	XPGM_BUFFCPY_STRING(char, http_headers, http_headers_pgm);

	size_t response_size = strlen(http_headers) + payload_size + 32;
	char *response = (char*) malloc(response_size);
	size_t response_len = snprintf(response, response_size, http_headers, payload_size);

	if (response_size - response_len < payload_size + 1) {
		CLIENT_ERROR(context, "Incorrect response buffer size %d: headers took %d, payload size %d",
				response_size, response_len, payload_size);
		free(response);
		free(payload);
		return;
	}
	memcpy(response + response_len, payload, payload_size);
	response_len += payload_size;

	free(payload);

	client_send(context, (byte*) response, response_len);

	free(response);
}

static const char PROGMEM json_200_response_headers_progmem[] = "HTTP/1.1 200 OK\r\n"
		"Content-Type: application/hap+json\r\n"
		"Transfer-Encoding: chunked\r\n"
		"Connection: keep-alive\r\n\r\n";

static const char PROGMEM json_207_response_headers_progmem[] = "HTTP/1.1 207 Multi-Status\r\n"
		"Content-Type: application/hap+json\r\n"
		"Transfer-Encoding: chunked\r\n"
		"Connection: keep-alive\r\n\r\n";

void send_json_response(client_context_t *context, int status_code, byte *payload,
		size_t payload_size) {
	CLIENT_DEBUG(context, "Sending JSON response");DEBUG_HEAP();

	static const char PROGMEM http_headers_pgm[] = "HTTP/1.1 %d %s\r\n"
			"Content-Type: application/hap+json\r\n"
			"Content-Length: %d\r\n"
			"Connection: keep-alive\r\n\r\n";

	XPGM_BUFFCPY_STRING(char, http_headers, http_headers_pgm);

	CLIENT_DEBUG(context, "Payload: %s", payload);

	// Using PSTR and strcpy_P. Ref: ESP.getResetReason
	//const char *status_text = "OK";
	char status_text[32];
	strcpy_P(status_text, PSTR("OK"));
	switch (status_code) {
	case 204:
		strcpy_P(status_text, PSTR("No Content"));
		break;
	case 207:
		strcpy_P(status_text, PSTR("Multi-Status"));
		break;
	case 400:
		strcpy_P(status_text, PSTR("Bad Request"));
		break;
	case 404:
		strcpy_P(status_text, PSTR("Not Found"));
		break;
	case 422:
		strcpy_P(status_text, PSTR("Unprocessable Entity"));
		break;
	case 500:
		strcpy_P(status_text, PSTR("Internal Server Error"));
		break;
	case 503:
		strcpy_P(status_text, PSTR("Service Unavailable"));
		break;
	}

	size_t response_size = strlen(http_headers) + payload_size + strlen(status_text) + 32;
	char *response = (char*) malloc(response_size);
	if (!response) {
		CLIENT_ERROR(context, "Failed to allocate response buffer of size %d", response_size);
		return;
	}
	size_t response_len = snprintf(response, response_size, http_headers, status_code, status_text,
			payload_size);

	if (response_size - response_len < payload_size + 1) {
		CLIENT_ERROR(context, "Incorrect response buffer size %d: headers took %d, payload size %d",
				response_size, response_len, payload_size);
		free(response);
		return;
	}
	memcpy(response + response_len, payload, payload_size);
	response_len += payload_size;
	response[response_len] = 0;  // required for debug output

	CLIENT_DEBUG(context, "Sending HTTP response: %s", response);

	client_send(context, (byte*) response, response_len);

	free(response);
}

