naanlizard/GootAC/lib/HomeKit-ESP8266/src/arduino_homekit_server.cpp
	client_context_free(context);
}

client_context_t* homekit_server_accept_client(homekit_server_t *server) {

	if (!server->wifi_server) {
		ERROR("The server's WiFiServer is NULL!");
		return NULL;
	}
	WiFiClient *wifiClient = nullptr;

	if (server->wifi_server->hasClient()) {
		wifiClient = new WiFiClient(server->wifi_server->accept());
		if (server->nfds >= HOMEKIT_MAX_CLIENTS) {
			INFO("No more room for client connections (max %d)", HOMEKIT_MAX_CLIENTS);
			wifiClient->stop();
			delete wifiClient;
			return NULL;
		}
		// Defensive: hasClient() returned true, but the remote may have
		// RST/FIN'd before available() ran. In that case wifiClient->_client
		// is NULL and the unconditional keepAlive() below dereferences NULL+9
		// (the keepalive_enabled field) -> LoadProhibited (exception 28) ->
		// reboot. connected() is null-safe (checks _client internally).
		if (!wifiClient->connected()) {
			INFO("wifiClient closed during accept (RST/FIN race)");
			wifiClient->stop();
			delete wifiClient;
			return NULL;
		}
	} else {
		return NULL;
	}

	INFO("Got new client %d: local %s:%d, remote %s:%d",
			wifiClient,
			wifiClient->localIP().toString().c_str(), wifiClient->localPort(),
			wifiClient->remoteIP().toString().c_str(), wifiClient->remotePort());

	wifiClient->setNoDelay(true);
	wifiClient->setSync(true);
	if (server->paired) {
		wifiClient->keepAlive(HOMEKIT_SOCKET_KEEPALIVE_IDLE_SEC,
			HOMEKIT_SOCKET_KEEPALIVE_INTERVAL_SEC, HOMEKIT_SOCKET_KEEPALIVE_IDLE_COUNT);
		wifiClient->setTimeout(HOMEKIT_SOCKET_TIMEOUT);
		DEBUG("Setting Timeout to 500ms");
	} else {
		// During the pairing process, relax the session timeout and be more aggressive about keepalives
		wifiClient->keepAlive(5, 5, 20);
		wifiClient->setTimeout(90000);
		INFO("Setting Timeout to 90 s");
	}

	client_context_t *context = client_context_new(wifiClient);
	context->server = server;
	context->socket = wifiClient;

	context->next = server->clients;
	server->clients = context;

	server->nfds++;

	HOMEKIT_NOTIFY_EVENT(server, HOMEKIT_EVENT_CLIENT_CONNECTED);

	return context;
}

//设备向iPhone传递characteristic的消息
void homekit_server_process_notifications(homekit_server_t *server) {
	client_context_t *context = server->clients;
	// 把characteristic_event_t拼接成client_event_t链表
	// 按照Apple的规定，Notify消息需合并发送
	while (context) {
		if (context->step != HOMEKIT_CLIENT_STEP_PAIR_VERIFY_2OF2) {
			// Do not send event when the client is not verify over.
			context = context->next;
			continue;
		}
		characteristic_event_t *event = NULL;
		if (context->event_queue && q_pop(context->event_queue, &event)) {
			#if HOMEKIT_LOG_LEVEL >= HOMEKIT_LOG_DEBUG
			char * valstr;
			homekit_value_print(&valstr, &event->value);
			CLIENT_VERBOSE(context, "Sending characteristic %d.%d change notification %s",
					event->characteristic->service->accessory->id, event->characteristic->id, valstr);
			free(valstr);
			#endif

			// Get and coalesce all client events
			client_event_t *events_head = (client_event_t*) malloc(sizeof(client_event_t));
			events_head->characteristic = event->characteristic;
			homekit_value_copy(&events_head->value, &event->value);
			events_head->next = NULL;

			homekit_value_destruct(&event->value);
			free(event);

			client_event_t *events_tail = events_head;

			while (q_pop(context->event_queue, &event)) {
				#if HOMEKIT_LOG_LEVEL >= HOMEKIT_LOG_DEBUG
				homekit_value_print(&valstr, &event->value);
				CLIENT_DEBUG(context, "Sending characteristic %d.%d change notification %s",
						event->characteristic->service->accessory->id, event->characteristic->id, valstr);
				free(valstr);
				#endif
				//q_pop第二个参数必须传指针的地址
				//event = context->event_queue->shift();
				client_event_t *e = events_head;
				while (e) {
					if (e->characteristic == event->characteristic) {
						break;
					}
					e = e->next;
				}

				if (e) {
					homekit_value_destruct(&e->value);
				} else {
					e = (client_event_t*) malloc(sizeof(client_event_t));
					e->characteristic = event->characteristic;
					e->next = NULL;

					events_tail->next = e;
					events_tail = e;
				}

				homekit_value_copy(&e->value, &event->value);

				homekit_value_destruct(&event->value);
				free(event);
			}

			send_client_events(context, events_head);

			client_event_t *e = events_head;
			while (e) {
				client_event_t *next = e->next;

				homekit_value_destruct(&e->value);
				free(e);

				e = next;
			}
		}

		context = context->next;
	}

}

bool homekit_client_need_process_data(client_context_t *context) {
	if (context) {
		return (context->step >= HOMEKIT_CLIENT_STEP_PAIR_SETUP_1OF3
				&& context->step < HOMEKIT_CLIENT_STEP_PAIR_VERIFY_2OF2);
	}
	return false;
}

//run in loop, include {accept_client, client_process, notifications}
void homekit_server_process(homekit_server_t *server) {

	homekit_server_accept_client(server);

	client_context_t *context = server->clients;
	while (context) {
		//homekit_client_process includes {handle data and stop disconnected client}
//		do{
//			if(homekit_client_need_process_data(context)){
//				CLIENT_INFO(context, "Step is %d", context->step);
//			}
//			delay(10);
		homekit_client_process(context);
//		} while(homekit_client_need_process_data(context));

		context = context->next;
	}
	homekit_server_process_notifications(server);
}

//=====================================================
// Arduino ESP8266 MDNS: call this function only once when WiFi STA is connected!
//=====================================================
bool homekit_mdns_started = false;

void homekit_mdns_init(homekit_server_t *server) {
	INFO("Configuring MDNS");
#if defined (MMU_IRAM_HEAP) && defined(HOMEKIT_USE_IRAM)
	HeapSelectIram ephemeral;
	INFO("Free IRAM Heap (homekit_mdns_init - entry): %d", ESP.getFreeHeap());
#endif
	if (!WiFi.isConnected()) {
		return;
	}

	IPAddress staIP = WiFi.localIP();
	if (!staIP.isSet()) {
		return;
	}

	homekit_accessory_t *accessory = server->config->accessories[0];
	homekit_service_t *accessory_info = homekit_service_by_type(accessory,
    HOMEKIT_SERVICE_ACCESSORY_INFORMATION);
	if (!accessory_info) {
		ERROR("Invalid accessory declaration: no Accessory Information service");
		return;
	}

	homekit_characteristic_t *name = homekit_service_characteristic_by_type(accessory_info,
    HOMEKIT_CHARACTERISTIC_NAME);

	if (!name || strlen(name->value.string_value) == 0) {
		ERROR("Invalid accessory declaration: " "no Name characteristic in AccessoryInfo service");
		return;
	}

