naanlizard/GootAC/lib/HomeKit-ESP8266/src/arduino_homekit_server.cpp
	homekit_characteristic_t *model = homekit_service_characteristic_by_type(accessory_info,
    HOMEKIT_CHARACTERISTIC_MODEL);

	if (!model) {
		ERROR("Invalid accessory declaration: " "no Model characteristic in AccessoryInfo service");
		return;
	}

	if (homekit_mdns_started) {
		// MDNS.close();
		MDNS.begin(name->value.string_value, staIP);
		INFO("MDNS restart: %s, IP: %s", name->value.string_value, staIP.toString().c_str());
		MDNS.announce();
#if defined (MMU_IRAM_HEAP) && defined(HOMEKIT_USE_IRAM)
		INFO("Free IRAM Heap (homekit_mdns_init - exit): %d", ESP.getFreeHeap());
#endif
		return;
	}

	//homekit_mdns_configure_init(name->value.string_value, PORT);
	WiFi.hostname(name->value.string_value);
	// Must specify the MDNS runs on the IP of STA
	MDNS.begin(name->value.string_value, staIP);
	INFO("MDNS begin: %s, IP: %s", name->value.string_value, staIP.toString().c_str());

	MDNSResponder::hMDNSService mdns_service = MDNS.addService(name->value.string_value,
    HOMEKIT_MDNS_SERVICE, HOMEKIT_MDNS_PROTO, HOMEKIT_SERVER_PORT);
	// Set a service specific callback for dynamic service TXT items.
	// The callback is called, whenever service TXT items are needed for the given service.
	MDNS.setDynamicServiceTxtCallback(mdns_service,
			[](const MDNSResponder::hMDNSService p_hService) {
				VERBOSE("MDNS call DynamicServiceTxtCallback");
				if (running_server) {
					MDNS.addDynamicServiceTxt(p_hService, "sf",
							(running_server->paired) ? "0" : "1");
					MDNS.addDynamicServiceTxt(p_hService, "c#",
							running_server->config->config_number);
				}

			}
	);
	MDNS.addServiceTxt(mdns_service, "md", model->value.string_value);
	// HAP R2 (2018+) protocol version. Most modern HK accessories advertise
	// pv=1.1. The Mixiaoxiao lib was originally HAP R1.
	MDNS.addServiceTxt(mdns_service, "pv", "1.1");
	MDNS.addServiceTxt(mdns_service, "id", server->accessory_id);
	//"c#" is a DynamicServiceTxt
	//Current configuration number. Required.
	//Must update when an accessory, service, or characteristic is added or removed on the accessory server.
	//Accessories must increment the config number after a firmware update.
	//This must have a range of 1-65535 and wrap to 1 when it overflows.
	//This value must persist across reboots, power cycles, etc.
	//MDNS.addServiceTxt(mdns_service, "c#", String(server->config->config_number).c_str());
	MDNS.addServiceTxt(mdns_service, "s#", "1");
	MDNS.addServiceTxt(mdns_service, "ff", "0");
	//"sf" is a DynamicServiceTxt
	//MDNS.addServiceTxt(HAP_SERVICE, HOMEKIT_MDNS_PROTO, "sf", (server->paired) ? "0" : "1");
	MDNS.addServiceTxt(mdns_service, "ci", String(server->config->category).c_str());

	if (server->config->setupId) {
		DEBUG("Accessory Setup ID = %s", server->config->setupId);

		size_t data_size = strlen(server->config->setupId) + strlen(server->accessory_id) + 1;
		char *data = (char*) malloc(data_size);
		snprintf(data, data_size, "%s%s", server->config->setupId, server->accessory_id);
		data[data_size - 1] = 0;

		unsigned char shaHash[SHA512_DIGEST_SIZE];
		wc_Sha512Hash((const unsigned char*) data, data_size - 1, shaHash);

		free(data);

		unsigned char encodedHash[9];
		memset(encodedHash, 0, sizeof(encodedHash));
		base64_encode_((const unsigned char*) shaHash, 4, encodedHash);
		MDNS.addServiceTxt(mdns_service, "sh", (char*) encodedHash);
	}

	MDNS.announce();
	MDNS.update();
	homekit_mdns_started = true;
#if defined (MMU_IRAM_HEAP) && defined(HOMEKIT_USE_IRAM)
	INFO("Free IRAM Heap (homekit_mdns_init - exit): %d", ESP.getFreeHeap());
#endif
}

// Used to update the config_number ("c#" value of Bonjour)
// Call this function when an accessory, service, or characteristic is added or removed on the accessory server.
// See the official HAP specification for more information.
void homekit_update_config_number() {
	if(!homekit_mdns_started) {
		return ;
	}
	if(!running_server){
		return;
	}
	// range of 1-65535
	uint16_t c = running_server->config->config_number;
	c = (c > 0 && c < 65535) ? (c + 1) : 1;
	running_server->config->config_number = c;
	MDNS.announce();
	MDNS.update();
	INFO("Update config_number to %u", c);
}

int homekit_accessory_id_generate(char *accessory_id) {
	byte buf[6];
	homekit_random_fill(buf, sizeof(buf));

	snprintf(accessory_id, ACCESSORY_ID_SIZE + 1, "%02X:%02X:%02X:%02X:%02X:%02X", buf[0], buf[1],
			buf[2], buf[3], buf[4], buf[5]);

	INFO("Generated new accessory ID: %s", accessory_id);
	return 0;
}

int homekit_accessory_key_generate(ed25519_key *key) {
	int r = crypto_ed25519_generate(key);
	if (r) {
		ERROR("Failed to generate accessory key");
		return r;
	}

	INFO("Generated new accessory key");

	return 0;
}

void homekit_server_init(homekit_server_config_t *config) {
	if (!config->accessories) {
		ERROR("Error initializing HomeKit accessory server: "
				"accessories are not specified");
		return;
	}

	if (!config->password && !config->password_callback) {
		ERROR("Error initializing HomeKit accessory server: "
				"neither password nor password callback is specified");
		return;
	}

	if (config->password) {
		const char *p = config->password;
		if (strlen(p) != 10
				|| !(ISDIGIT(p[0]) && ISDIGIT(p[1]) && ISDIGIT(p[2]) && p[3] == '-' && ISDIGIT(p[4])
						&& ISDIGIT(p[5]) && p[6] == '-' && ISDIGIT(p[7]) && ISDIGIT(p[8])
						&& ISDIGIT(p[9]))) {
			ERROR("Error initializing HomeKit accessory server: " "invalid password format");
			return;
		}
	}

	if (config->setupId) {
		const char *p = config->setupId;
		if (strlen(p) != 4
				|| !(ISBASE62(p[0]) && ISBASE62(p[1]) && ISBASE62(p[2]) && ISBASE62(p[3]))) {
			ERROR("Error initializing HomeKit accessory server: " "invalid setup ID format");
			return;
		}
	}

	homekit_accessories_init(config->accessories);
	if (!config->config_number) {
		config->config_number = config->accessories[0]->config_number;
		if (!config->config_number) {
			config->config_number = 1;
		}
	}
	if (!config->category) {
		config->category = config->accessories[0]->category;
	}
	homekit_server_t *server = server_new();
	running_server = server;
	server->config = config;

	//homekit_server_task(server);
	INFO("Starting server");

